# Задача 1.
# Создать и обработать файлы
# Есть данные:
# data_2023_01 = [
#     "2023-01-01:1000:Иван Иванов",
#     "2023-01-02:1500:Петр Петров",
#     "2023-01-03:2000:Мария Сидорова"
# ]

# data_2023_02 = [
#     "2023-02-01:1200:Иван Иванов",
#     "2023-02-02:1800:Петр Петров",
#     "2023-02-03:2200:Мария Сидорова"
# ]

# data_2023_03 = [
#     "2023-03-01:1300:Иван Иванов",
#     "2023-03-02:1700:Петр Петров",
#     "2023-03-03:2100:Мария Сидорова"
# ]
# 1. Нужно создать файлы:
# Каждый файл имеет формат sales_YYYY_MM.txt, где YYYY — год, а MM — месяц. Внутри каждого файла данные представлены в формате:
# Дата:Сумма продаж:Менеджер.

# Пример файла sales_2023_01.txt:

# 2023-01-01:1000:Иван Иванов
# 2023-01-02:1500:Петр Петров
# 2023-01-03:2000:Мария Сидорова

# 2. Напишите скрипт, который:
# - Считает общую сумму продаж за все месяцы.
# - Находит менеджера с наибольшей суммой продаж.
# - Сохраняет результаты в файл report.txt в формате:
# Общая сумма продаж: <сумма>
# Лучший менеджер: <имя менеджера>


def fileWrite(file, value):
    '''
    Docstring for fileWrite
    
    :param file: link
    :param value: information
    '''
    with open(file, 'w', encoding='utf-8') as sales:

        for i in range(0, len(value)):
            sales.write(f'{value[i]}\n')
    return

data_2023_01 = [
    "2023-01-01:1000:Иван Иванов",
    "2023-01-02:1500:Петр Петров",
    "2023-01-03:2000:Мария Сидорова"
]

data_2023_02 = [
    "2023-02-01:1200:Иван Иванов",
    "2023-02-02:1800:Петр Петров",
    "2023-02-03:2200:Мария Сидорова"
]

data_2023_03 = [
    "2023-03-01:1300:Иван Иванов",
    "2023-03-02:1700:Петр Петров",
    "2023-03-03:2100:Мария Сидорова"
]


fileWrite('sales_2023_01.txt', data_2023_01)
fileWrite('sales_2023_02.txt', data_2023_02)
fileWrite('sales_2023_03.txt', data_2023_03)

all_data = data_2023_01 + data_2023_02 + data_2023_03 

total_sales = 0 
manager_sales = {} 

for line in all_data: 
    date, amount, manager = line.split(':') 
    amount = int(amount) 
    total_sales += amount 
    manager_sales[manager] = manager_sales.get(manager, 0) + amount 
    best_manager = max(manager_sales, key=manager_sales.get) 


with open('files/report.txt', 'w', encoding='utf-8') as report: 
    report.write(f'Общая сумма продаж: {total_sales}\n') 
    report.write(f'Лучший менеджер: {best_manager}\n')

